""" Userbot module for other small commands. """

from userbot import CMD_HELP
from userbot.events import register


@register(outgoing=True, pattern="^.shalom$")
async def shalom(e):
    await e.edit(
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️☁️☁️☁️⭐️⭐️☁️☁️"
        "\n☁️⭐️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️⭐️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️⭐️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️☁️⭐️⭐️☁️☁️☁️⭐️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️☁️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️☁️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️☁️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️☁️☁️☁️⭐️☁️☁️⭐️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️☁️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️☁️⭐️⭐️⭐️⭐️⭐️☁️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️⭐️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️⭐️☁️"
        "\n☁️⭐️☁️☁️☁️☁️☁️⭐️☁️"
        "\n☁️☁️⭐️⭐️⭐️⭐️⭐️☁️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☁️"
        "\n☁️☁️☁️☁️☁️☁️⭐️☁️☁️"
        "\n☁️☁️☁️☁️⭐️⭐️☁️☁️☁️"
        "\n☁️☁️☁️☁️☁️☁️⭐️☁️☁️"
        "\n☁️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☁️"
        "\n☁️☁️☁️☁️☁️☁️☁️☁️☁️")

    CMD_HELP.update({
        'shalom':
        '📚 **Cmd** : `.shalom`\
\n📄 **Descriptions** : memberikan SHALOM yang bagus sebagai output.'
    })
